# Створюємо словник(бібліотеку)
biblioteka = {"П'ятнадцятирічний капітан": {"Автор": "Жуль Верн", "Рік видання": 2009, "Кількість сторінок": 432},
           "451 за Фаренгейтом": {"Автор": "Рей Бредбері", "Рік видання": 2011, "Кількість сторінок": 208},
           "Воно": {"Автор": "Стівен Кінг", "Рік видання": 1987, "Кількість сторінок": 1344},
            "Аутсайдер": {"Автор": "Стівен Кінг", "Рік видання": 2019, "Кількість сторінок": 592},
            "Вбивство у cхідному експресі": {"Автор": " Аґата Крісті", "Рік видання": 2022, "Кількість сторінок": 288},
           }

book_name = input("Введіть назву книги: ")# Вводимо назву книги
if book_name in biblioteka: #Перевіряємо та при наявності кнги виводимо інформацію про неї
    book_info = biblioteka[book_name]
    print(f"Інформація про книгу '{book_name}':")
    print(f"Автор: {book_info['Автор']}.",f"Рік видання: {book_info['Рік видання']}.",f"Кількість сторінок: {book_info['Кількість сторінок']}.")
else:
    print(f"Книга з назвою '{book_name}' не знайдена у бібліотеці.")